mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_SYSCON.h
/*! @name EMVSIM1CLKDIV - EMVSIM1 Function Clock Division */
/*! @{ */

#define SYSCON_EMVSIM1CLKDIV_DIV_MASK            (0x7U)
#define SYSCON_EMVSIM1CLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock divider value */
#define SYSCON_EMVSIM1CLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM1CLKDIV_DIV_SHIFT)) & SYSCON_EMVSIM1CLKDIV_DIV_MASK)

#define SYSCON_EMVSIM1CLKDIV_RESET_MASK          (0x20000000U)
#define SYSCON_EMVSIM1CLKDIV_RESET_SHIFT         (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_EMVSIM1CLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM1CLKDIV_RESET_SHIFT)) & SYSCON_EMVSIM1CLKDIV_RESET_MASK)

#define SYSCON_EMVSIM1CLKDIV_HALT_MASK           (0x40000000U)
#define SYSCON_EMVSIM1CLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_EMVSIM1CLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM1CLKDIV_HALT_SHIFT)) & SYSCON_EMVSIM1CLKDIV_HALT_MASK)

#define SYSCON_EMVSIM1CLKDIV_UNSTAB_MASK         (0x80000000U)
#define SYSCON_EMVSIM1CLKDIV_UNSTAB_SHIFT        (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_EMVSIM1CLKDIV_UNSTAB(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM1CLKDIV_UNSTAB_SHIFT)) & SYSCON_EMVSIM1CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name KEY_RETAIN_CTRL - Key Retain Control */
/*! @{ */

#define SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_VALID_MASK (0x1U)
#define SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_VALID_SHIFT (0U)
/*! KEY_RETAIN_VALID - Indicates if the PUF key has been retained in the VBAT domain and has not
 *    been reset or otherwise invalidated by software.
 *  0b0..PUF key is not retained in VBAT domain.
 *  0b1..PUF key is retained in VBAT domain.
 */
#define SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_VALID(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_VALID_SHIFT)) & SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_VALID_MASK)

#define SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_DONE_MASK (0x2U)
#define SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_DONE_SHIFT (1U)
/*! KEY_RETAIN_DONE - Indicates the successful completion of the key_save or key_load routine. Once
 *    set, to clear the key_retain_done flag, both key_save and key_load should be cleared by
 *    software.
 *  0b0..Key save / load sequence has not completed.
 *  0b1..Key save / load sequence has completed.
 */
#define SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_DONE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_DONE_SHIFT)) & SYSCON_KEY_RETAIN_CTRL_KEY_RETAIN_DONE_MASK)

#define SYSCON_KEY_RETAIN_CTRL_KEY_SAVE_MASK     (0x10000U)
#define SYSCON_KEY_RETAIN_CTRL_KEY_SAVE_SHIFT    (16U)
/*! KEY_SAVE
 *  0b0..Key save sequence is disabled.
 *  0b1..Key save sequence is enabled.
 */
#define SYSCON_KEY_RETAIN_CTRL_KEY_SAVE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_KEY_RETAIN_CTRL_KEY_SAVE_SHIFT)) & SYSCON_KEY_RETAIN_CTRL_KEY_SAVE_MASK)

#define SYSCON_KEY_RETAIN_CTRL_KEY_LOAD_MASK     (0x20000U)
#define SYSCON_KEY_RETAIN_CTRL_KEY_LOAD_SHIFT    (17U)
/*! KEY_LOAD
 *  0b0..Key load sequence is disabled.
 *  0b1..Key load sequence is enabled.
 */
#define SYSCON_KEY_RETAIN_CTRL_KEY_LOAD(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_KEY_RETAIN_CTRL_KEY_LOAD_SHIFT)) & SYSCON_KEY_RETAIN_CTRL_KEY_LOAD_MASK)
/*! @} */

/*! @name REF_CLK_CTRL - FRO 48MHz Reference Clock Control */
/*! @{ */

#define SYSCON_REF_CLK_CTRL_GDET_REFCLK_EN_MASK  (0x1U)
#define SYSCON_REF_CLK_CTRL_GDET_REFCLK_EN_SHIFT (0U)
/*! GDET_REFCLK_EN - GDET reference clock enable bit
 *  0b0..Disabled.
 *  0b1..Enabled
 */
#define SYSCON_REF_CLK_CTRL_GDET_REFCLK_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_REF_CLK_CTRL_GDET_REFCLK_EN_SHIFT)) & SYSCON_REF_CLK_CTRL_GDET_REFCLK_EN_MASK)

#define SYSCON_REF_CLK_CTRL_TRNG_REFCLK_EN_MASK  (0x2U)
#define SYSCON_REF_CLK_CTRL_TRNG_REFCLK_EN_SHIFT (1U)
/*! TRNG_REFCLK_EN - ELS TRNG reference clock enable bit
 *  0b0..Disabled.
 *  0b1..Enabled
 */
#define SYSCON_REF_CLK_CTRL_TRNG_REFCLK_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_REF_CLK_CTRL_TRNG_REFCLK_EN_SHIFT)) & SYSCON_REF_CLK_CTRL_TRNG_REFCLK_EN_MASK)
/*! @} */

/*! @name REF_CLK_CTRL_SET - FRO 48MHz Reference Clock Control Set */
/*! @{ */

#define SYSCON_REF_CLK_CTRL_SET_GDET_REFCLK_EN_SET_MASK (0x1U)
#define SYSCON_REF_CLK_CTRL_SET_GDET_REFCLK_EN_SET_SHIFT (0U)
/*! GDET_REFCLK_EN_SET - GDET reference clock enable set bit
 *  0b0..No effect.
 *  0b1..Set to 1
 */
#define SYSCON_REF_CLK_CTRL_SET_GDET_REFCLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_REF_CLK_CTRL_SET_GDET_REFCLK_EN_SET_SHIFT)) & SYSCON_REF_CLK_CTRL_SET_GDET_REFCLK_EN_SET_MASK)

#define SYSCON_REF_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_MASK (0x2U)
#define SYSCON_REF_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_SHIFT (1U)
/*! TRNG_REFCLK_EN_SET - ELS TRNG reference clock enable set bit
 *  0b0..No effect.
 *  0b1..Set to 1
 */
#define SYSCON_REF_CLK_CTRL_SET_TRNG_REFCLK_EN_SET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_REF_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_SHIFT)) & SYSCON_REF_CLK_CTRL_SET_TRNG_REFCLK_EN_SET_MASK)
/*! @} */

/*! @name REF_CLK_CTRL_CLR - FRO 48MHz Reference Clock Control Clear */
/*! @{ */

#define SYSCON_REF_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_MASK (0x1U)
#define SYSCON_REF_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_SHIFT (0U)
/*! GDET_REFCLK_EN_CLR - GDET reference clock enable clear bit
 *  0b0..No effect.
 *  0b1..Set to 0
 */
#define SYSCON_REF_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_REF_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_SHIFT)) & SYSCON_REF_CLK_CTRL_CLR_GDET_REFCLK_EN_CLR_MASK)

#define SYSCON_REF_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_MASK (0x2U)
#define SYSCON_REF_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_SHIFT (1U)
/*! TRNG_REFCLK_EN_CLR - ELS TRNG reference clock enable clear bit
 *  0b0..No effect.
 *  0b1..Set to 0
 */
#define SYSCON_REF_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_REF_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_SHIFT)) & SYSCON_REF_CLK_CTRL_CLR_TRNG_REFCLK_EN_CLR_MASK)
/*! @} */

/*! @name GDET_CTRL - GDET Control Register */
/*! @{ */

#define SYSCON_GDET_CTRL_GDET_EVTCNT_CLR_MASK    (0x1U)
#define SYSCON_GDET_CTRL_GDET_EVTCNT_CLR_SHIFT   (0U)
/*! GDET_EVTCNT_CLR - Controls the GDET clean event counter
 *  0b0..Event counter not cleared
 *  0b1..Clears event counter
 */
#define SYSCON_GDET_CTRL_GDET_EVTCNT_CLR(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_GDET_CTRL_GDET_EVTCNT_CLR_SHIFT)) & SYSCON_GDET_CTRL_GDET_EVTCNT_CLR_MASK)

#define SYSCON_GDET_CTRL_GDET_ERR_CLR_MASK       (0x2U)
#define SYSCON_GDET_CTRL_GDET_ERR_CLR_SHIFT      (1U)
/*! GDET_ERR_CLR - Clears GDET error status
 *  0b0..Error status not cleared
 *  0b1..Clears error status
 */
#define SYSCON_GDET_CTRL_GDET_ERR_CLR(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_GDET_CTRL_GDET_ERR_CLR_SHIFT)) & SYSCON_GDET_CTRL_GDET_ERR_CLR_MASK)

#define SYSCON_GDET_CTRL_GDET_ISO_SW_MASK        (0xCU)
#define SYSCON_GDET_CTRL_GDET_ISO_SW_SHIFT       (2U)
/*! GDET_ISO_SW - GDET isolation control
 *  0b00..Isolation is disabled
 *  0b01..Isolation is disabled
 *  0b10..Isolation is enabled. When both GDET0_CTRL/GDET1_CTRL GDET_ISO_SW are "10", isolation_on is asserted.
 *  0b11..Isolation is disabled
 */
#define SYSCON_GDET_CTRL_GDET_ISO_SW(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_GDET_CTRL_GDET_ISO_SW_SHIFT)) & SYSCON_GDET_CTRL_GDET_ISO_SW_MASK)

#define SYSCON_GDET_CTRL_EVENT_CNT_MASK          (0xFF00U)
#define SYSCON_GDET_CTRL_EVENT_CNT_SHIFT         (8U)
/*! EVENT_CNT - Event count value */
#define SYSCON_GDET_CTRL_EVENT_CNT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_GDET_CTRL_EVENT_CNT_SHIFT)) & SYSCON_GDET_CTRL_EVENT_CNT_MASK)

